# PlanCircuitSet Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuitSet Class
Members See Also
---
A set that can contain any number of plan circuit objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PlanCircuitSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class PlanCircuitSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class PlanCircuitSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..PlanCircuitSet
# See Also
PlanCircuitSet Members
Autodesk.Revit.DB Namespace